---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionDate
source: html/379f01f0-bae9-5a2b-9dd5-150998f7d17d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionDate Property

"Current Revision Date"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetCurrentRevisionDate { get; }
```